# -*- coding: utf-8 -*-
"""Homework_1.2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1niN5WXKw-gs-lQfGX5sysJgYoYoeabZ5
"""

# Задача 1.2.

# Пункт A. 
# Приведем плейлист песен в виде списка списков
# Список my_favorite_songs содержит список названий и длительности каждого трека
# Выведите общее время звучания трех случайных песен в формате
# Три песни звучат ХХХ минут

my_favorite_songs = [
    ['Waste a Moment', 3.03],
    ['New Salvation', 4.02],
    ['Staying\' Alive', 3.40],
    ['Out of Touch', 3.03],
    ['A Sorta Fairytale', 5.28],
    ['Easy', 4.15],
    ['Beautiful Day', 4.04],
    ['Nowhere to Run', 2.58],
    ['In This World', 4.02],
]

# пробовала с модулем datetime - получилось перевести время каждого трека во временной формат, 
# но запуталась при сложении времени, поэтому пошла более простым, но возможно долгим путем через 
# математический перевод времени элементарными приемами
# from datetime import timedelta, datetime
# res_dt = datetime.strptime(str(list1[0][1]), '%M.%S')

import random

list1 = random.sample(my_favorite_songs, 3)
print(list1)

tlt = 0
#tracklist time

for i in range(len(list1)):
  tlt += int(list1[i][1])*60 + (list1[i][1] % int(list1[i][1])*100)
tlt = int(tlt/60) + tlt % 60 / 100
print('\n Три песни звучат', '%.2f' % tlt, 'минут')