# -*- coding: utf-8 -*-
"""Homework 1.1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1S5EpY-tDlH3k9O-hBVaNwAgZKu-oTWGD
"""

# Задача 1.1.
# Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
# Нельзя переопределять my_favorite_songs и запятая не должна выводиться.

my_favorite_songs = 'Waste a Moment, Staying\' Alive, A Sorta Fairytale, Start Me Up, New Salvation'

songs_list = my_favorite_songs.split(',')
print(songs_list[0], songs_list[-1], songs_list[1], songs_list[-2])