# -*- coding: utf-8 -*-
"""task_2.1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1bM4QmlQLtrGUMQj_hbKNn0RDA3IYhTaZ
"""

# Задача 2.1. 

# Создайте две функции maximum и minimum,
# которые получают список целых чисел в качестве входных данных 
# и возвращают наибольшее и наименьшее число в этом списке соответственно.
# Например,
# * [4,6,2,1,9,63,-134,566]         -> max = 566, min = -134
# * [-52, 56, 30, 29, -54, 0, -110] -> min = -110, max = 56
# * [42, 54, 65, 87, 0]             -> min = 0, max = 87
# * [5]                             -> min = 5, max = 5
# функции max и min использовать нельзя!

def minimum(arr):
  min1 = arr[0]
  for x in arr:
    if min1 > x:
      min1 = x
  return(min1)

def maximum(arr):
  max1 = arr[0]
  for x in arr:
    if max1 < x:
      max1 = x
  return(max1)

print('Введите список целых чисел:')
inp = input()

arr = []
num = ''

for i in inp:
  if i == '-' and num == '':    #проверка, наличия отрицательного числа - знак минус перед числом
    num +=i
  else:
    if i.isdigit():
      num += i
    else:
      if num != '':
        arr.append(int(num))
        num = ''
if num != '':
  arr.append(int(num))

print('Список:', arr, ', min =', minimum(arr), ', max =', maximum(arr))