# -*- coding: utf-8 -*-
"""task_2_2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1zXGkSt7GXfOn-GieNfYzTmdNfEzVZgBa
"""

# Задача 2.2. 

# Напишите функцию, которая возвращает номер квартал по номеру месяца
# Например: 
# месяц 2 (февраль) является частью первого квартала; 
# месяц 6 (июнь) является частью второго квартала; 
# месяц 11 (ноябрь) является частью четвертого квартала.

def quarter_of(month):
  names = {1: 'Январь', 2: 'Февраль', 3: 'Март', 4: 'Апрель', 5: 'Май', 
           6: 'Июнь', 7: 'Июль', 8: 'Август', 9: 'Сентябрь', 10: 'Октябрь',
           11: 'Ноябрь', 12: 'Декабрь'}
  kvartal = [['первый', 1, 2, 12],
             ['второй', 3, 4, 5],
             ['третий', 6, 7, 8],
             ['четвертый', 9, 10, 11]]

  kv = ''
  for i1 in range(len(kvartal)):
    for i2 in kvartal[i1]:
      if i2 == month:
        kv = kvartal[i1][0]  
  return [names[month], kv]

print('Добрый день! Введите номер месяца:')
a = input()
if str.isdigit(a) and (0 < int(a) < 13):
    print('Месяц №', a, '-', quarter_of(int(a))[0], '-', quarter_of(int(a))[1], 'квартал.')
else:
  print('Некорректный ввод!')

