# -*- coding: utf-8 -*-
"""task_1.4.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1j8Ea4zqTQs26HyIwTh8xbB4vU0qowV7i
"""

# Задача 1.4.

# Есть словарь кодов товаров titles
# Товары находятся на складе и сохранены в виде словаря списков словарей,
# которые отражают количество товаров в магазине по каждому коду.
# Рассчитайте на какую сумму лежит каждого товара на складе.
# Вывести суммарную стоимость каждого товара в магазине в формате:
# "<товар> - <кол-во> шт, стоимость <общая стоимость> руб"

# Пример: "Кроссовки тип 3 (Adidas) - 31 шт, стоимость 50747 руб"

titles = {
    'Кроссовки тип 3 (Adidas)': '100000110',
    'Мячик тип 2 (Adidas)': '100000146',
    'Кепка тип 1 (Adidas)': '100000149',
    'Ремень тип 2 (Nike)': '100000194',
    'Футболка тип 1 (Adidas)': '100000224',
    'Шапка тип 5 (Puma)': '100000280',
}

store = {
    '100000110': [{'quantity': 31, 'price': 1637}],
    '100000146': [ {'quantity': 4, 'price': 45}, {'quantity': 10, 'price': 48}],
    '100000149': [ {'quantity': 28, 'price': 279}, {'quantity': 32, 'price': 291}],
    '100000194': [{'quantity': 8, 'price': 220}, {'quantity': 1, 'price': 170}],
    '100000224': [{'quantity': 61, 'price': 438}, {'quantity': 23, 'price': 302},  {'quantity': 50, 'price': 412}],
    '100000280': [{'quantity': 26, 'price': 175}, ]
}

for key in titles:
  a = store[titles.get(key)] # список словарей, полученный по id из store
  sum, sum1, num, num1 = 0, 0, 0, 0

  for i in a: # i - словарь - элемент списка, соответствующий определенному id
    num = i.get('quantity')
    sum = num * i.get('price')
    num1 += num
    sum1 += sum

  print(key, '-', num1, 'шт., общая стоимость -', sum1)

