# -*- coding: utf-8 -*-
"""task_2_3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1dntFRRaqgfXY8k1-Qyjd3WdUlO6Dad13
"""

# Задача 2.3.

# Напишите функцию, которая принимает цифры от 0 до 9 и возвращает значение прописью.
# Например,
# switch_it_up(1) -> 'One'
# switch_it_up(3) -> 'Three'
# switch_it_up(10000) -> None
# Использовать условный оператор if-elif-else нельзя!

def switch_it_up(number):
    num_lst = {0: 'Zero', 1: 'One', 2: 'Two', 3: 'Three', 4: 'Four',
               5: 'Five', 6: 'Six', 7: 'Seven', 8: 'Eight', 9: 'Nine'}
    return num_lst[number]


print('Добрый день! Введите цифру от 0 до 9:')
a = input()
if str.isdigit(a) and (0 < int(a) < 9):
    print(a, '-', switch_it_up(int(a)))
else:
  print('Некорректный ввод!')